---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymDRight
source: html/7f3df2b6-a250-086c-0c54-16ba32bd393c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamSpanSymDRight Property

"D_Right"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamSpanSymDRight { get; }
```